# selection and indexing

In [213]:
import numpy as np 
import pandas as pd

In [214]:
data = {
    'EMP_id' : range(1,21),
    'Name' : ['kaushik','kanji','ram','raj','janvi','dharuvi','kinjal','diya','darshna','sneha','komal','daxa','ajay','rakesh','jayesg','shayam','ramesh','yogita','yash','yogesh'],
    'Age' : np.random.randint(20,45,20),
    'Department' : ['IT','HR','ACCOUNT','FINANCE','IT','HR','IT','HR','ACCOUNT','FINANCE','FINANCE','IT','HR','ACCOUNT','FINANCE','IT','HR','ACCOUNT','FINANCE','IT'],
    'Salary' : np.random.randint(50000,150000,20),
    'City' : ['Ahmedabad','pune','vadodra','delhi','jamnagar','veraval','rajkot','mumbai','udaipur','gandhinagar','junagadh','surat','vapi','banaskatha','jamnagar','veraval','rajkot','mumbai','udaipur','amreli'] 
}

In [215]:
df = pd.DataFrame(data)
df

    EMP_id     Name  Age Department  Salary         City
0        1  kaushik   41         IT   53609    Ahmedabad
1        2    kanji   37         HR   87574         pune
2        3      ram   36    ACCOUNT   74473      vadodra
3        4      raj   29    FINANCE  127733        delhi
4        5    janvi   29         IT  125939     jamnagar
5        6  dharuvi   28         HR   91098      veraval
6        7   kinjal   41         IT   97987       rajkot
7        8     diya   30         HR  136405       mumbai
8        9  darshna   43    ACCOUNT   58760      udaipur
9       10    sneha   21    FINANCE   78150  gandhinagar
10      11    komal   20    FINANCE  133113     junagadh
11      12     daxa   29         IT   52669        surat
12      13     ajay   27         HR  136698         vapi
13      14   rakesh   25    ACCOUNT  132351   banaskatha
14      15   jayesg   44    FINANCE  131538     jamnagar
15      16   shayam   44         IT  125175      veraval
16      17   ramesh   33         HR   80182       rajkot
17      18   yogita   37    ACCOUNT  115058       mumbai
18      19     yash   40    FINANCE  124372      udaipur
19      20   yogesh   21         IT   72226       amreli

# selection

In [216]:
df[['Name','Age','Salary']]

       Name  Age  Salary
0   kaushik   41   53609
1     kanji   37   87574
2       ram   36   74473
3       raj   29  127733
4     janvi   29  125939
5   dharuvi   28   91098
6    kinjal   41   97987
7      diya   30  136405
8   darshna   43   58760
9     sneha   21   78150
10    komal   20  133113
11     daxa   29   52669
12     ajay   27  136698
13   rakesh   25  132351
14   jayesg   44  131538
15   shayam   44  125175
16   ramesh   33   80182
17   yogita   37  115058
18     yash   40  124372
19   yogesh   21   72226

In [217]:
salary = df['Salary']

np.sum(salary)

np.int64(2035110)

In [218]:
# df[['EMP_id','Name','Age','Department','Salary','City']]

# add new column

In [221]:
df['Work_exp'] = np.random.randint(1,5,20)
df['ratting'] = np.random.randint(1,7,20)

In [222]:
df

    EMP_id     Name  Age Department  Salary         City  Work_exp  ratting
0        1  kaushik   41         IT   53609    Ahmedabad         3        1
1        2    kanji   37         HR   87574         pune         3        4
2        3      ram   36    ACCOUNT   74473      vadodra         1        4
3        4      raj   29    FINANCE  127733        delhi         1        1
4        5    janvi   29         IT  125939     jamnagar         1        6
5        6  dharuvi   28         HR   91098      veraval         4        6
6        7   kinjal   41         IT   97987       rajkot         1        3
7        8     diya   30         HR  136405       mumbai         4        5
8        9  darshna   43    ACCOUNT   58760      udaipur         3        1
9       10    sneha   21    FINANCE   78150  gandhinagar         1        1
10      11    komal   20    FINANCE  133113     junagadh         1        4
11      12     daxa   29         IT   52669        surat         3        4
12      13     ajay   27         HR  136698         vapi         4        5
13      14   rakesh   25    ACCOUNT  132351   banaskatha         1        2
14      15   jayesg   44    FINANCE  131538     jamnagar         2        4
15      16   shayam   44         IT  125175      veraval         4        1
16      17   ramesh   33         HR   80182       rajkot         3        5
17      18   yogita   37    ACCOUNT  115058       mumbai         1        2
18      19     yash   40    FINANCE  124372      udaipur         3        4
19      20   yogesh   21         IT   72226       amreli         4        1

# Delate column

In [224]:
df.drop('Work_exp',axis=1)

    EMP_id     Name  Age Department  Salary         City  ratting
0        1  kaushik   41         IT   53609    Ahmedabad        1
1        2    kanji   37         HR   87574         pune        4
2        3      ram   36    ACCOUNT   74473      vadodra        4
3        4      raj   29    FINANCE  127733        delhi        1
4        5    janvi   29         IT  125939     jamnagar        6
5        6  dharuvi   28         HR   91098      veraval        6
6        7   kinjal   41         IT   97987       rajkot        3
7        8     diya   30         HR  136405       mumbai        5
8        9  darshna   43    ACCOUNT   58760      udaipur        1
9       10    sneha   21    FINANCE   78150  gandhinagar        1
10      11    komal   20    FINANCE  133113     junagadh        4
11      12     daxa   29         IT   52669        surat        4
12      13     ajay   27         HR  136698         vapi        5
13      14   rakesh   25    ACCOUNT  132351   banaskatha        2
14      15   jayesg   44    FINANCE  131538     jamnagar        4
15      16   shayam   44         IT  125175      veraval        1
16      17   ramesh   33         HR   80182       rajkot        5
17      18   yogita   37    ACCOUNT  115058       mumbai        2
18      19     yash   40    FINANCE  124372      udaipur        4
19      20   yogesh   21         IT   72226       amreli        1

# delate multiple column

In [225]:
df.drop(['Work_exp','ratting'],axis=1,inplace=True)

In [226]:
df

    EMP_id     Name  Age Department  Salary         City
0        1  kaushik   41         IT   53609    Ahmedabad
1        2    kanji   37         HR   87574         pune
2        3      ram   36    ACCOUNT   74473      vadodra
3        4      raj   29    FINANCE  127733        delhi
4        5    janvi   29         IT  125939     jamnagar
5        6  dharuvi   28         HR   91098      veraval
6        7   kinjal   41         IT   97987       rajkot
7        8     diya   30         HR  136405       mumbai
8        9  darshna   43    ACCOUNT   58760      udaipur
9       10    sneha   21    FINANCE   78150  gandhinagar
10      11    komal   20    FINANCE  133113     junagadh
11      12     daxa   29         IT   52669        surat
12      13     ajay   27         HR  136698         vapi
13      14   rakesh   25    ACCOUNT  132351   banaskatha
14      15   jayesg   44    FINANCE  131538     jamnagar
15      16   shayam   44         IT  125175      veraval
16      17   ramesh   33         HR   80182       rajkot
17      18   yogita   37    ACCOUNT  115058       mumbai
18      19     yash   40    FINANCE  124372      udaipur
19      20   yogesh   21         IT   72226       amreli

# define row

In [227]:
df.loc[0]

EMP_id                1
Name            kaushik
Age                  41
Department           IT
Salary            53609
City          Ahmedabad
Name: 0, dtype: object

In [228]:
# multiple
df.loc[[0,1,2]]

   EMP_id     Name  Age Department  Salary       City
0       1  kaushik   41         IT   53609  Ahmedabad
1       2    kanji   37         HR   87574       pune
2       3      ram   36    ACCOUNT   74473    vadodra